app/views/contacts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
      <td><%= contact.addr %></td>
      <% user = User.find(params[:id]=contact.user_id) %>