app/controllers/contacts_controller.rb

SELECT "users".* FROM "users"
---
	def index
		@contacts = Contact.accessible_by(current_ability)
		@users = User.all

SELECT "users".* FROM "users"
---
	def new
		@contact = Contact.new
		@users = User.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"
---
	def edit
		@contact = Contact.find(params[:id])
		@users = User.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "contacts" SET "name" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "contacts"."id" = $4  [["name", "dije1"], ["phone_number", "081285735470"], ["updated_at", "2015-01-27 03:50:54.524760"], ["id", 4]]
---
	def update
		@contact = Contact.find(params[:id])
		@contact.assign_attributes(contact_params)
		authorize! :update, @contact

		if @contact.update(contact_params)

INSERT INTO "contacts" ("name", "phone_number", "addr", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "QWE"], ["phone_number", "089834356578"], ["addr", "Surabaya"], ["user_id", 1], ["created_at", "2015-01-19 07:52:17.684982"], ["updated_at", "2015-01-19 07:52:17.684982"]]
---
	def create
		@contact = Contact.new(contact_params)
		if @contact.user == nil
			@contact.user = current_user
		else
			@contact.user.id = :user_id
		end
		authorize! :create, @contact

  		if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
	def destroy
		@contact = Contact.find(params[:id])
		authorize! :destroy, @contact
		@contact.destroy