app/controllers/phones_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "phones" ("more_phone", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["more_phone", "089834356578"], ["contact_id", 1], ["created_at", "2015-01-26 02:56:16.382314"], ["updated_at", "2015-01-26 02:56:16.382314"]]
---
  def create
    @contact = Contact.find(params[:contact_id])
    @phone = @contact.phone.create(phone_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "phones".* FROM "phones" WHERE "phones"."contact_id" = $1 AND "phones"."id" = $2 LIMIT 1  [["contact_id", 2], ["id", 2]]
DELETE FROM "phones" WHERE "phones"."id" = $1  [["id", 2]]
---
  def destroy
    @contact = Contact.find(params[:contact_id])
    @phone = @contact.phone.find(params[:id])
    @phone.destroy